Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.Attributes Property
 The attributes for the section mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkAttributes Attributes { get; set; }
Public Property Attributes As SectionMarkBase.SectionMarkAttributes
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkAttributes
See Also
Reference
SectionMarkBase Class
Tekla.Structures.Drawing Namespace